[M_IrisDL2_DontTalkAbtMama MissionDefinition]
MissionName="O Profanador de Mães"
MissionDescription="Um motoqueiro chamado Hamhock tentou pegar nos peitos da Moxxi, a mãe do Scooter. Ele pediu pra você encontrar esse Hamhock e acabar com ele."
TurnInDescription="Terminou tudo bem o que agora será conhecido como ''O Engano de Hamhock''."
MissionSummary="Encontre o Hamhock e administre uma dose de chumbo."
MissionGiver="Scooter"
MissionTurnInLocation="Scooter ou Moxxi"
TeaserText="Ninguém se aproveita da mãe do Scooter!"

[M_IrisDL2_DontTalkAbtMama:FakeKillHamhock MissionObjectiveDefinition]
ProgressMessage="Elimine o Hamhock"

[M_IrisDL2_DontTalkAbtMama:KillHamhock MissionObjectiveDefinition]
ProgressMessage="Elimine Hamhock para o Scooter"

[M_IrisDL2_DontTalkAbtMama:KillScooterMen MissionObjectiveDefinition]
ProgressMessage="Elimine os assassinos para a Moxxi"

[M_IrisDL2_DontTalkAbtMama:MissionObjectiveSetBranchingDefinition_0 MissionObjectiveSetBranchingDefinition]
MissionSummaryOverride="Elimine Hamhock ou os assassinos contratados pelo Scooter."
MissionDescriptionOverride="Um motoqueiro chamado Hamhock tentou pegar nos peitos da Moxxi, a mãe do Scooter. Ele pediu pra você encontrar esse Hamhock e acabar com ele.\n\nNo entanto, Moxxi entrou em contato com você assim que encontrou o Hamhock.  Devido ao fato de que as relações que ela teve com o Hamhock terem sido de comum acordo, ela lhe propôs que, se você perdoar a vida do Hamhock e matar os assassinos enviados pelo Scooter, ela lhe recompensará com muita generosidade.\n\nPor outro lado, o Scooter disse que o Hamhock é um assassino e se você matá-lo, ele também irá te recompensar muito bem.\nParece que você tem que tomar uma decisão."

[M_IrisDL2_DontTalkAbtMama:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisDL2_DontTalkAbtMama:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisDL2_DontTalkAbtMama:ReachBeatdown MissionObjectiveDefinition]
ProgressMessage="Encontre o Hamhock"

